[
  {
    "_id": "B1",
    "research_title": "Smart Tourism Practices in Naga City:  An Assessment",
    "research_members": ["Cynthia Liza Arce Abarca, MBA", "Maricar Bien, MM", "Maria Cristina Maniquiz, MBA", "Jason Keith Boñaga, AEM, MDRCM, MBA"],
    "created_at": "April 11, 2023",
    "research_status": "Concept Note (Approval)",
    "concept_note":{
        "project_title": "Utilization and Effectiveness of Disaster Risk Reduction Management Interventions in Naga City: Basis for a Tactical Framework",
        "implementing_agency": "College of Arts and Sciences",
        "cooperating_agency": "LGU-Naga\n",
        "site_of_implementation": "Naga City",
        "project_duration": "March 2023 – March 2024",
        "total_project_cost": "P20,000,00",
        "funding_source": "LGU-NAGA and UNC",
        "project_description": "The geographical location of the Philippines is distinguished as a profound shed of man-made disasters and natural calamities.",
        "significance": "The DRRM interventions need to assess the level of utilization and its effectiveness. This study is anchored to the UNC Research Agenda number one, Application of Data Analytics in Disaster Risk Management, and Environment Sustainability. This study is aligned with SDG number 13, Climate Action The tapped agency for the conduct of this study is the LGU-Naga. Mier-Manjares (2020) emphasizes that Rinconada Area is an agricultural-centered sector wherein farming is the primary source of their livelihood. Rice fields are being flooded, which causes the rising water level that affects their head of living, their houses, and their safety and security from the flood.  Based on Domingo & Manejar (2018) discussion, the evaluation method sees the implementation process to monitor if the policies reached their target outcomes. It reviewed the programs across their phases and activities, and output. Interventions include complexity of behavior and social factors as it is critical to check on the existing policies and analyze the comprehensiveness and effect of the implementation process for the stakeholders that includes the intended effect. \n",
        "objectives": "General Objective:\nThis study aims to determine the utilization and effectiveness of the DRRM interventions in Naga City as a basis of a tactical framework.\n\nSpecific Objectives: \n1. Identify the DRRM interventions in the different barangays of Naga City.\n2. Determine the utilization level of the DRRM interventions of different barangays in the city in terms of mitigation, preparedness, response, and rehabilitation.\n3. Measure the effectiveness of the DRRM interventions in the different barangays of Naga City. \n4. Correlate the utilization level and effectiveness of the DRRM interventions.\n5. To come up with a tactical framework for the utilization of The DRRM interventions. \n\n",
        "methodology": "General Objective:\nThis study aims to determine the utilization and effectiveness of the DRRM interventions in Naga City as a basis of a tactical framework.\n\nSpecific Objectives: \n1. Identify the DRRM interventions in the different barangays of Naga City.\n2. Determine the utilization level of the DRRM interventions of different barangays in the city in terms of mitigation, preparedness, response, and rehabilitation.\n3. Measure the effectiveness of the DRRM interventions in the different barangays of Naga City. \n4. Correlate the utilization level and effectiveness of the DRRM interventions.\n5. To come up with a tactical framework for the utilization of The DRRM interventions. \n\n",
        "technology_roadmap": "N/A",
        "expected_outputs": "The expected output from this study will benefit the BDRRMO and residents of the Local Government Unit of Naga. The developmental output will be a tactical plan wherein the framework and command system are integrated to formulate procedures to mitigate and manage the disaster risk based on the four components of DRRM: Mitigation, Preparedness, Response, and Rehabilitation. \n\n",
        "work_plan": ""
      }
  },
  {
    "_id": "B2",
    "research_title": "Prognostication of the Factors Affecting the Low Enrollment Turnout on the Biology Course at UNC, Naga City for the Past 5 Years",
    "research_members": ["Dr. Josephine Alba", "Dr. Sheila Anzano", "Maria Fatima Parro"],
    "created_at": "April 12, 2023",
    "research_status": "Concept Note (Approved)",
    "concept_note":{
      "project_title": "Martial Law Activism in Naga City: Revisiting Lived Experiences and Narratives\n\n",
      "implementing_agency": "UNC Center for Nueva Caceres Studies",
      "cooperating_agency": "Potential Partner Agencies or Organizations are Pending\n\n",
      "site_of_implementation": "Naga City",
      "project_duration": "April to December 2023",
      "total_project_cost": "Budget is Pending",
      "funding_source": "University of Nueva Caceres/Pending Agency or Organization",
      "project_description": "The study will be a uniquely undertake to document the narratives of the activists in Naga City during Martial Law. This is important because there is little to no documentation of that period from the point of view of activists especially in the context various localities in the country. This implies that the results of the study will be an important addition to local history of the city.\n\nThe research will result an important addition to the documentation of the Martial Law Period. This is important since there are a significant amount of undocumented accounts and narratives of that period especially from the various regions and provinces in the Philippines. This can serve as an important contribution to efforts to present a more accurate, comprehensive and detailed account of that period in historical references for future generations to study.\n",
      "significance": "",
      "objectives": "The study will document and analyze the lived experiences of activists of Naga City during the Martial Law Period. The results of this research will be used to create a compilation of the narratives of various Martial Law activists in Naga. \n\nThis study seeks to answer the following questions:\n1. What is the profile of activists in Naga City during the Martial Law Period?;\n2. What are the highlights in the experiences of Martial Law activists in the City of Naga?; and \n3. What are the differences between the narratives of the activists in Naga and leading accounts of the Martial Law period?\n\n",
      "methodology": "This study will employ the qualitative phenomenological approach. This particular approach focuses on human experiences as well as existing content that those also represent those experiences (Taylor et al., 2016). This means that this research will employ in-depth interviews. The interviewees will be surviving Martial Law activists in Naga City. The research may include interviews of historical experts and scholars to gain additional insights on the experiences of activists in the city during the said historical period. The study will also include analysis of content about the said activists and material authored by them. Before the interviews can proceed the researchers will secure the consent of the prospective interviewees. ",
      "technology_roadmap": "N/A\n",
      "expected_outputs": "The project will lead to the creation of a research manuscript. Each of the museums of Naga City, academic institutions and the City Government will be given a copy of the completed manuscript. \n\nThe data from the study can be used as the basis for a book which will be a compilation of the stories of activists in Naga during the Martial Law period.\n",
      "work_plan": ""
    }
  },
  {
    "_id": "B3",
    "research_title": "PSYCHOLOGICAL WELL-BEING, COPING STRATEGIES, AND ACADEMIC PERFORMANCE OF GEN-Z LEARNERS",
    "research_members": ["Charey Mae Alvarado"],
    "research_status": "Concept Note (Rejected)",
    "created_at": "April 13, 2023",
    "concept_note":{
      "project_title": "Prognostication of the Factors Affecting the Low Enrollment Turnout on the Biology Course at UNC, Naga City for the Past 5 Years\n\n",
      "implementing_agency": "CAS",
      "cooperating_agency": "None",
      "site_of_implementation": "UNC",
      "project_duration": "*Please see attached Gantt Chart",
      "total_project_cost": "*No budget plan yet",
      "funding_source": "*No Funding Source yet",
      "project_description": "This project is focused on identifying the reasons behind the low enrollment turnout on the Biology Program for the Past 5 years at UNC, Naga City.",
      "significance": "*This area of the research: To follow",
      "objectives": "*This area of the research: To follow",
      "methodology": "\n*This area of the research: To follow\n",
      "technology_roadmap": "*Not Applicable",
      "expected_outputs": "\n*This area of the research: To follow\n",
      "work_plan": ""
    }
  },
  {
    "_id": "B4",
    "research_title": "Attrition Rate of the BS Accountancy Program for A.Y. 2021-2022 and A.Y. 2022-2023",
    "research_members": ["Salvador C. Arcilla, MAT, PhD", "Aileen N. Mendoza, CPA, MBA", "Philip B. Lozada, CPA", "Maria Carla R. Mañago, CPA", "Maribel N. Ballon, MBA"],
    "created_at": "April 14, 2023",
    "research_status": "Concept Note (For Review)",
    "concept_note":{
      "_id": "A4",
      "project_title": "Memory Intervention Strategy: An Approach Towards Memory Retention of Biology Concepts for College Students",
      "implementing_agency": "None",
      "cooperating_agency": "None",
      "site_of_implementation": "UNC",
      "project_duration": "2023 (Please Refer to the Gantt Chart)",
      "total_project_cost": "Php. 10,000 for printing test materials and M.I.S. Biology modules",
      "funding_source": "Self-funding",
      "project_description": "Biology students must memorize terms and it is difficult to memorize without comprehending these terms. The research mentioned aims to present some Memory intervention strategies for College students who are taking up Biology as their course. Specifically, the research is geared in addressing the following objectives:\n\nIdentify the level of memory (immediate, short-term, long-term) of the Biology students prior to the M.I.S.\nIdentify the M.I.S. strategy that best suit Biology Students\nIdentify the significant difference of the level of memory of the Biology students who are immersed in the M.I.S. and those who are immersed in the traditional method\nIdentify the significant difference on the level of memory of the Biology students before and after the M.I.S.\nIdentify if the M.I.S. strategy was able to convert immediate or short-term memory into long-term memory\n\n",
      "significance": "\nBiology is a pre-med course subject and it involves lots of memorization and comprehension. The research involving the M.I.S. program is geared towards the enhancement of memory retention of the Biology students which most probably would have a scientific merit.\n\n",
      "objectives": "The Research Study is about “Memory Intervention Strategy: An Approach Towards Memory Retention of Biology Concepts for College Students”.\n\nSpecifically, it seeks to address the following problems:\nAssess the Need to develop MIS\nIdentify the Validity of the MIS\nDevelop a MIS aimed at improving memory retention among students.\nDetermine the pre-test and posttest scores of the Biology students\nDetermine the Memory Retention Level of the students prior to the Intervention Process (STM, IM LTM)\nDetermine the Memory Retention Level of the students after the Intervention Process\nDetermine the Memory Retention Level of the students who immersed M.I.S. as compared to the students who did not immerse in M.I.S.\nDetermine significant differences before/after, between groups of students, among memory types\nIdentify the perceptions (level of acceptability) of the students and teachers after the M.I.S. on the use of the MIS  \nHow will the MIS contribute to the realization of the learning outcomes expected of students?\n",
      "methodology": "Variables\nIndependent variables: temperature of the room, time and day when the intervention was administered\nDependent Variables: Memory Retention Level, Student and Teacher’s perceptions, pre-test and posttest scores\n\n\nFigure 1. Proposed Conceptual Framework of the Study (but is subjected to revisions) based from the MRL scope\n\n",
      "technology_roadmap": "Not Applicable",
      "expected_outputs": "Deliverables: To Follow",
      "work_plan": ""
    }
  },
  {
    "_id": "B5",
    "research_title": "Solar Powered Desalination by Thermal Evaporation Heating Process with filtration system",
    "research_members": ["Engr. Edwin SJ. Badiola"],
    "research_status": "Concept Note (For Review)",
    "created_at": "April 15, 2023",
    "concept_note":{
      "_id": "A5",
      "project_title": "Strategic, Integrated, and Institutional Partnership Program: UNC’s way of bridging the gap between the Academe and the Industry\n\n",
      "implementing_agency": "Career Center",
      "cooperating_agency": "Colleges",
      "site_of_implementation": "University of Nueva Caceres \nJaime Hernandez Avenue, Naga City, Camarines Sur 4400, Bicol Region\n",
      "project_duration": "This research must be completed on or before March 2024",
      "total_project_cost": "N/A",
      "funding_source": "University of Nueva Caceres fund",
      "project_description": "The study shall focus on Implementing a Strategic  Industry-University Partnership. While working on the Institutional Career Pathway Framework, one noticeable discovery is that there was no institutional and systematic approach to the University Partnership initiatives. \n\nBased on the workshop of MIT facilitated by Lars Froland which is anchored in his book -” Strategic Industry-University Partnership” the success of an Institution’s partnership with Industry depends on the “five (5) success factors continuously aligned with goals”. During the mini-workshop conducted with the Acad Team with the context of “why should the Acad Department have the kind of aligned partnership with other Departments in the University by using the 5-factors, it was discovered that indeed, there were things that need to be aligned to effectively support the University in the delivery of its promise to be - future-ready, work-ready and life ready. It may be completed in a concise period of time but the result yields something that the University needs to consider.\n\nWith the deployment of the Workforce Development Trainers who will facilitate the education and training such as the Professional Employment Program, the Career Center will have more time to focus on Linkages and Partnerships to provide strategic support relative to recruitment and placement which will also directly impact the Employability Metrics of the Institution.\n\nAs such, it is high time to calibrate all the partnership initiatives of the University to convert the “ad hoc transactional relations and no deep and strategic partnerships” to “develop a systematic and  strategic approach to industry partnership\n\n",
      "significance": "UNC Research Agenda: \n#5 Design and Assessment of Innovative Projects for Institutional/rural/urban (eco) system development.\n\nConcept and context (internship, employment, MQuAP, work and study); MIT Partnership Canvas x QS Asia Ranking; Internationalization\n\nReview of Related Literature:\nBased on the study, “Industry-university partnerships have proved vital to innovation, and although these partnerships can be challenging, careful choices and wise management around five success-factors lead to a systematic approach that unlocks value for both parties.” (Chris Sciaca, Allesandro Curioni - 2018)\nStrategic Industry-University Partnership- A Success Factor from Innovative Companies - 2018\n\n\nAccording to the study, “Collaborations between companies and universities are critical drivers of the innovation economy. These relationships have long been a mainstay of corporate research and development (R&D) — from creating the knowledge foundations for the next generation of solutions, to serving as an extended “workbench” to solve short-term, incremental problems, to providing a flow of newly minted talent.” - Developing Successful Strategic Partnership with Universities - 2018 by: Lars Frolund, Fiona Murray, Max Riedel\n\nWhat makes industry–university collaboration succeed? A systematic review of the literature - 2018 by: Robert Rybnicek and Roland Konigsgruber\n\nUniversity–industry cooperation: A systematic literature review and research agenda- 2018 by CarlaMa scarenhas,  João J Ferreira and Carla Marques \n\n\n\n",
      "objectives": "To create an institutional integrated employer partnership program using the design thinking approach. Further, this study aims to:\n\nAssess the current internship and employer partnership program of the Colleges along programs and policies\nIdentify the benefits and areas for improvement in the existing internship and employer partnership program of the Colleges\ndevelop an integrated institutional employer partnership framework\n\n",
      "methodology": "This study will use the multi-method using design thinking approach. \n\nto answer the research objectives:\n1. to assess (emphasize + define) - survey; further details through FGD (curriculum; learning outcomes expected, measure on the outcomes if achieved;  student experience vs expected outcomes)\n2. to identify the gap/AFI (ideate)\n3. develop EPS (prototype + test)\n\n",
      "technology_roadmap": "N/A",
      "expected_outputs": "Employer Partnership System Integrated Framework",
      "work_plan": ""
    }
  },
  {
    "_id": "B6",
    "research_title": "The New Board Licensure Examination for Criminologist: Identifying Strategies for A Better Board Examination Rating of UNC Examinees",
    "research_members": ["Vincent Vittorio A. Balmaceda, RCrim", "Lorlie B. Tanjay, Ph.D"],
    "research_status": "Concept Note (For Review)",
    "created_at": "April 16, 2023",
    "concept_note":{
      "_id": "A6",
      "project_title": "Smart Tourism Practices in Naga City:  An Assessment\n\n",
      "implementing_agency": "College of Business and Accountancy – Hospitality and Tourism Cluster\n\n",
      "cooperating_agency": "CBA\nURC\n",
      "site_of_implementation": "All tourism destinations in Naga City",
      "project_duration": "March 2023- August 2023",
      "total_project_cost": "",
      "funding_source": "The College of Business and Accountancy and University Research Center.",
      "project_description": "The Department of Tourism (DOT), through the Tourism Promotions Board (TPB), continues to support destinations that are adapting smart tourism as a response to the pandemic.  In the Future and Innovation for Digital Tourism talk of Dr. Daryl Ace Cornell during the SIKAT Convention in Batangas last November 28, 2022, he mentioned that information technologies (internet, mobile communications, 3D) contribute to the implementation of digital tourism in the framework of new global tourist information systems. Many travel  agencies are now forced to reorient themselves to the \nrequirements of customers and are looking for improvement in their work.\n\n\nThe concept of Smart Tourism is defined by the European Union as a destination facilitating access to tourism and hospitality products, services, spaces and experiences through ICT-based (Information and Communications Technology) tools. (EU, 2022)\n\nThe study will focus  on the assessment of the SMART Tourism implementation in Naga City, along sustainability, accessibility, digitization, and cultural and heritage creativity.\n\n\n\n",
      "significance": "UNC Research Agenda No. 4\nUN SDG- 9 -  Industry Innovation and Infrastructure\nUN SDG 11- Sustainable Cities and Communities\n\nAgencies to be tapped for this research are the University REL Office, Bicol Regional Tourism Council, Naga City Tourism Council and the Arts, Culture and Tourism Office (ACTO).\n",
      "objectives": "The objectives of the study would be: \nTo determine the current practices of smart tourism in Naga City along sustainability, accessibility, digitization, and cultural and heritage creativity.\nIdentify the strengths, weaknesses, opportunities and threats of the current business practices.\nTo come up with a proposed business model or framework can be adapted to improve the current practices that can pave the way to making Naga City as another Smart Tourism destination in the Philippines.\n\n",
      "methodology": "This is a descriptive-narrative (evaluative) study.  Survey forms and/or Google Survey will be used.  Part I will be the Profile of the Respondents and Part II will be for determining the effectiveness of these smart tourism practices.\n\nRespondents will be tourism entities in Naga \nCity, practicing smart tourism, and these are the hotels, resorts, restaurants, and souvenir shops.\n\nFrequencies and percentages will be used for the profile of the respondents and Weighted Mean and Rank will be used for the status of smart tourism practices in Naga City.\n",
      "technology_roadmap": "N/A",
      "expected_outputs": "For Publication",
      "work_plan": ""
    }
  },
  {
    "_id": "B7",
    "research_title": "Strategic, Integrated, and Institutional Partnership Program: UNC’s way of bridging the gap between the Academe and the Industry",
    "research_members": ["Jo-Ann Dancalan", "Janice Brabante", "Paolo Suzara"],
    "research_status": "Concept Note (For Review)",
    "created_at": "April 17, 2023",
    "concept_note":{
      "_id": "A7",
      "project_title": "A Strategic Plan to Improve Student Retention in the UNC College of Business and Accountancy",
      "implementing_agency": "Business Administration and Accountancy programs of the College of Business and Accountancy of the University of Nueva Caceres.",
      "cooperating_agency": "The University Research Center (URC) of the University of Nueva Caceres\n\n",
      "site_of_implementation": "N/A",
      "project_duration": "August 2023 to December 2023\n",
      "total_project_cost": "N/A",
      "funding_source": "The College of Business and Accountancy and the University Research Center.",
      "project_description": "CHED Memorandum Order No. 27 series of 2017 or the Revised Policies, Standards, and Guidelines for  Bachelor of Science in  Accountancy  (BSA) makes it imperative for the BSA program to provide a foundation of professional knowledge, professional skills, and professional values, ethics and attitudes that enable them to continue to learn and adapt to change (ched.gov.ph).\n\nThe effective evaluation procedure of the university has something to do with the graduates’ performance in the licensure examination (Amanonce & Maramag, 2020)\n\nIn view of this, higher education institutions implement a retention policy for all the BS Accountancy programs to maintain quality graduates from the program being that Accountants play a vital role in the economy (B. Diokno, 2021)\n\nDetermining the aspects that are considered crucial by the students for their academic advancement and providing it at the right time, will help higher education to address the issue of attrition of students by supporting and furthering their learning progress. These mechanisms should be designed to foster the learning and sense of community among the students. The importance of student performance as an intermediary in the causal process of the learning progress and attrition status emanates from the need to create an effective support program to keep the retention of students. (Nikolaidis et al, 2022)\n\nIn this connection, the expanded opportunity is a mechanism that is implemented to assist in avoiding attrition from the program.\n\nBean and Metzner (1985) included GPA and its relationship to attrition among college students in their model. Most researchers find that this factor is more related to community colleges than university due to the different academic settings of the two groups. This is commented upon by many researchers (Leone and Tian, 2009; Kinloch, 2012; Nakajima et al., 2012).\n",
      "significance": "The results and findings of this study shall serve as one of the groundworks of the College of Business and Accountancy of the University of Nueva Caceres in its thrust of delivering quality education to its students, particularly those enrolled in the Bachelor of Science in Accountancy, through continuous quality improvement.  \n\nIdentifying the challenges encountered by the students enrolled in this program and the factors affecting their academic performance shall likewise serve as basis in enhancing the retention policy of the college.  Thereby, giving no reason for the students to shift in other programs or transferring in other higher education institutions.\n\n",
      "objectives": "General Objective: To determine the Attrition Rate of the BS Accountancy Program for A.Y. 2021-2022 and A.Y. 2022-2023\nTo develop a strategic plan to improve student retention in the UNC College of Business and Accountancy\n\nSpecific Objectives:\n\nFirst:  Develop the strategic plan\n          Implement\n          Evaluate\n\nTo determine the percentage of students who are retained in the program;\nTo identify the factors affecting the students from not retaining under the Accountancy program;\nTo determine the challenges encountered by Accountancy students in retaining the program;\nTo determine the relationship between students’ retention, challenges encountered, and factors affecting retention;\nTo propose an enhancement on the existing retention policy for the Accountancy program.\n",
      "methodology": "This research will use the descriptive-evaluative design. The descriptive design is used to obtain information that describes a situation, in this case, the attrition rate of BS in Accountancy program. On the other hand, the evaluative design is appropriate to assess whether the program has effective existing current policy in fitting the needs or wants of the students. \n\nCorrelation tests will be used to determine whether student attrition rate is related to the challenges they encounter in the accountancy program.\n\nThe population of this study is all the students currently enrolled in the Accountancy program and those who have already shifted to another course for the A.Y. 2021-2023. \n\nA survey questionnaire will be deployed to the students where they will be asked questions such as the reasons for shifting, challenges encountered, and suggestions to better retain students in the Accountancy program.\n\n",
      "technology_roadmap": "N/A",
      "expected_outputs": "For Publication",
      "work_plan": ""
    }
  },
  {
    "_id": "B8",
    "research_title": "Utilization and Effectiveness of Disaster Risk Reduction Management Interventions in Naga City: Basis for a Tactical Framework",
    "research_members": ["Maiden Angelica R. Hernandez"],
    "research_status": "Concept Note (For Review)",
    "created_at": "April 18, 2023",
    "concept_note":{
      "_id": "A8",
      "project_title": "\"Streamlining Outcome-Based Education and Continuous Quality Improvement of University of Nueva Caceres through Technology: A Information Management System for Improving Inclusiveness\"",
      "implementing_agency": "COLLEGE OF COMPUTER STUDIES\n\n",
      "cooperating_agency": "RESEARCH CENTER\nCOLLEGE DEPARTMENT\nVPAA\n",
      "site_of_implementation": "COLLEGIATE LEVEL IN THE UNIVERSITY OF NUEVA CACERES\n",
      "project_duration": "12 MONTHS",
      "total_project_cost": "PHP 438,000.00",
      "funding_source": "UNC",
      "project_description": "Outcome-based education (OBE) and continuous quality improvement (CQI) are two of the most important concepts in education today. OBE is a student-centered approach that focuses on the development of specific skills, knowledge, and attitudes that are relevant to the needs of the society. (Akir et al., 2012) CQI, on the other hand, is a continuous process of For Review, analyzing, and improving educational practices and policies to ensure that the highest quality of education is delivered. (Misran et al.,2011)\n\nIn recent years, there has been a growing interest in the development and utilization of new educational technologies and resources for inclusive education (Smith, 2018). This is because these technologies have the potential to significantly improve the efficiency and effectiveness of OBE-CQI processes.\n\nThe University of Nueva Caceres, like many other educational institutions, has faced various challenges in implementing OBE-CQI effectively. One of the main challenges is the manual entry of data, which can be time-consuming and prone to errors (Liu & Huang, 2019). To address this challenge, the researchers propose to develop an Information Management System (IMS) to automate the data entry process.\n\nThe IMS is expected to improve the inclusiveness of OBE-CQI at the University of Nueva Caceres by making the process more efficient and effective. By streamlining the data entry process, the faculty will be able to focus more on the important tasks of teaching and learning. Additionally, the IMS will also help to reduce the errors and inconsistencies that can occur in manual data entry (Chen, 2021).\n\nTherefore, the research aims to design, develop, and evaluate the IMS for OBE-CQI at the University of Nueva Caceres. The study will focus on the following areas: variables or parameters to be measured and evaluated or analyzed; treatments to be used and their layout; experimental procedures and design; statistical analysis; evaluation method and observations to be made; and strategies for implementation.\n",
      "significance": "Outcome-based education (OBE) and continuous quality improvement (CQI) are two of the most important concepts in education today. OBE is a student-centered approach that focuses on the development of specific skills, knowledge, and attitudes that are relevant to the needs of the society. (Akir et al., 2012) CQI, on the other hand, is a continuous process of For Review, analyzing, and improving educational practices and policies to ensure that the highest quality of education is delivered. (Misran et al.,2011)\n\nIn recent years, there has been a growing interest in the development and utilization of new educational technologies and resources for inclusive education (Smith, 2018). This is because these technologies have the potential to significantly improve the efficiency and effectiveness of OBE-CQI processes.\n\nThe University of Nueva Caceres, like many other educational institutions, has faced various challenges in implementing OBE-CQI effectively. One of the main challenges is the manual entry of data, which can be time-consuming and prone to errors (Liu & Huang, 2019). To address this challenge, the researchers propose to develop an Information Management System (IMS) to automate the data entry process.\n\nThe IMS is expected to improve the inclusiveness of OBE-CQI at the University of Nueva Caceres by making the process more efficient and effective. By streamlining the data entry process, the faculty will be able to focus more on the important tasks of teaching and learning. Additionally, the IMS will also help to reduce the errors and inconsistencies that can occur in manual data entry (Chen, 2021).\n\nTherefore, the research aims to design, develop, and evaluate the IMS for OBE-CQI at the University of Nueva Caceres. The study will focus on the following areas: variables or parameters to be measured and evaluated or analyzed; treatments to be used and their layout; experimental procedures and design; statistical analysis; evaluation method and observations to be made; and strategies for implementation.\n",
      "objectives": "This study will be valuable for universities and colleges looking to improve the inclusiveness of their educational environment and streamline the implementation of Outcome-Based Education and Continuous Quality Improvement.\n\n\nThe proposed Information  management system has the potential to serve as a model for other universities and colleges looking to integrate technology into their education processes.\n\n",
      "methodology": "The research will adopt EXPLORATORY DESIGN (Multi-method  design) incorporating both qualitative and quantitative approaches, to explore the problem and determine possible solutions to facilitate the implementation of Outcome-Based Education and Continuous Quality Improvement (OBE-CQI) in the university.\n\nThe qualitative component will involve the collection of data through content analysis and semi-structured interviews with relevant stakeholders, such as faculty members and students. Thematic analysis will be used to identify patterns and themes in the data and to gain an understanding of the challenges and potential solutions related to the implementation of OBE-CQI.\n\nThe quantitative component of the study will involve a descriptive analysis, using a survey as the data gathering tool. The survey will assess the level of user acceptance (based on the ISO standard 9001) and impact of the proposed solutions .\n\nIn terms of statistical analysis, the study will use percentage and standard deviation to analyze and summarize the data collected.\n",
      "technology_roadmap": "To be followed",
      "expected_outputs": "Publication, Intellectual Property, and Product",
      "work_plan": ""
    }
  }
]
